[Killed] BlockStatement
main/pages/Articles/ArticlesIndexPage.js:3:45
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function ArticlesIndexPage() {
-
-  // Stryker disable all : articles for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p><a href="/articles/create">Create</a></p>
-        <p><a href="/articles/edit/1">Edit</a></p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function ArticlesIndexPage() {}
 
killedBy: ArticlesIndexPage tests Renders expected content
statusReason: Error: ArticlesIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
