[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.js:28:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
             
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid="MenuItemReviewForm-id"
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             <Form.Group className="mb-3" >
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="/MenuItemReviewForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewForm.js:28:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
             
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid="MenuItemReviewForm-id"
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="id">Id</Form.Label>
+                    <Form.Control data-testid="MenuItemReviewForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                </Form.Group>}
 
             <Form.Group className="mb-3" >
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
main/components/MenuItemReviews/MenuItemReviewForm.js:89:23
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.stars?.message}
-                    {(errors.stars?.type === 'min') && 'Minimum rating of 1 star'}
+                    {(errors.stars?.type !== 'min') && 'Minimum rating of 1 star'}
                     {(errors.stars?.type === 'max') && 'Maximum rating of 5 stars'}
                 </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Minimum rating of 1 star</div> instead

[Killed] OptionalChaining
main/components/MenuItemReviews/MenuItemReviewForm.js:89:23
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.stars?.message}
-                    {(errors.stars?.type === 'min') && 'Minimum rating of 1 star'}
+                    {(errors.stars.type === 'min') && 'Minimum rating of 1 star'}
                     {(errors.stars?.type === 'max') && 'Maximum rating of 5 stars'}
                 </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.js:90:23
                 <Form.Control.Feedback type="invalid">
                     {errors.stars?.message}
                     {(errors.stars?.type === 'min') && 'Minimum rating of 1 star'}
-                    {(errors.stars?.type === 'max') && 'Maximum rating of 5 stars'}
+                    {(true) && 'Maximum rating of 5 stars'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Maximum rating of 5 stars</div> instead

[Killed] OptionalChaining
main/components/MenuItemReviews/MenuItemReviewForm.js:90:23
                 <Form.Control.Feedback type="invalid">
                     {errors.stars?.message}
                     {(errors.stars?.type === 'min') && 'Minimum rating of 1 star'}
-                    {(errors.stars?.type === 'max') && 'Maximum rating of 5 stars'}
+                    {(errors.stars.type === 'max') && 'Maximum rating of 5 stars'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.js:104:22
                     {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateReviewed && 'Date is required.'}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewForm.js:104:22
                     {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateReviewed && 'Date is required.'}
+                    {errors.dateReviewed || 'Date is required.'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on stars less than 1
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
