[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:38:23
         },
         {
             Header: 'Menu Item Id',
-            accessor: 'itemId',
+            accessor: "",
         },
         {
killedBy: MenuItemReviewsTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewsTable-cell-row-0-col-itemId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:40:9
             Header: 'Menu Item Id',
             accessor: 'itemId',
         },
-        {
-            Header: 'Email',
-            accessor: 'reviewerEmail',
-        },
+        {},
         {
             Header: 'Stars',
killedBy: MenuItemReviewsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:49:21
             accessor: 'stars',
         },
         {
-            Header: 'Date (iso format)',
+            Header: "",
             accessor: 'dateReviewed',
         },
killedBy: MenuItemReviewsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date (iso format). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:54:23
         },
         {
             Header: 'Comments',
-            accessor: 'comments',
+            accessor: "",
         }
     ];
killedBy: MenuItemReviewsTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewsTable-cell-row-0-col-comments"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/MenuItemReviews/MenuItemReviewsTable.js:58:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewsTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     return <OurTable
killedBy: MenuItemReviewsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewsTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:59:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewsTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "MenuItemReviewsTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewsTable"));
     } 
killedBy: MenuItemReviewsTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:59:68
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewsTable"));
+        columns.push(ButtonColumn("Edit", "primary", editCallback, ""));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewsTable"));
     } 
killedBy: MenuItemReviewsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewsTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:60:45
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewsTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "MenuItemReviewsTable"));
     } 
 
killedBy: MenuItemReviewsTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
