[Killed] ConditionalExpression
main/components/Restaurants/RestaurantForm.js:14:26
         formState: { errors },
         handleSubmit,
     } = useForm(
-        { defaultValues: initialContents || {}, }
+        { defaultValues: true, }
     );
    
killedBy: RestaurantCreatePage tests renders without crashing
statusReason: TypeError: Cannot create property 'name' on boolean 'true'

[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.js:61:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="description">Description</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-description"}
+                    data-testid={testIdPrefix + ""}
                     id="description"
                     type="text"
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RestaurantForm-description"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
