[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:53:23
         },
         {
             Header: 'Date',
-            accessor: 'dateAdded',
+            accessor: "",
         }
     ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-dateAdded"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
